nusschAngE/stm32h7xx/Hardware/flash/qspi_flash.c

#include "stm32h7xx.h"
#include "qspi_flash.h"
#include "delay.h"

/********* W25Qxxx command ***********/
/* write enable/disable cmd */
#define W25Q_WRITE_ENABLE     0x06
#define W25Q_WRITE_ENVSR      0x50//volatile status register
#define W25Q_WRITE_DISABLE    0x04
/* read status register */
#define W25Q_READ_SR1         0x05
#define W25Q_READ_SR2         0x35
#define W25Q_READ_SR3         0x15
/* write status register */
#define W25Q_WRITE_SR1        0x01
#define W25Q_WRITE_SR2        0x31
#define W25Q_WRITE_SR3        0x11
/* read id */
#define W25Q_READID           0x90
#define W25Q_READID_DSPI      0x92
#define W25Q_READID_QSPI      0x94
/* QSPI Enable &Disable */
#define W25Q_QSPI_ENABLE      0x38
#define W25Q_QSPI_DISABLE     0xff
/* address mode */
#define W25Q_ADDR_3BYTE       0xe9
#define W25Q_ADDR_4BYTE       0xb7
/* fast read */
#define W25Q_FAST_READ        0x0b
#define W25Q_FAST_READ4B      0x0c
/* page program */
#define W25Q_PAGE_PROGRAM     0x02
/* sector erase */
#define W25Q_SECTOR_ERASE     0x20
/* set read parameter */
#define W25Q_READ_PARA        0xc0
/* reset */
#define W25Q_RESET_ENABLE	  0x66
#define W25Q_RESET			  0x99

/*
*  W25Qxxx Status Registers 
*/
typedef enum
{
    W25Qxx_SR1 = 0,
    W25Qxx_SR2,
    W25Qxx_SR3
}W25Qxxx_SR;

/* QSPI interface state */
enum
{
    QSPI_OK          = 0,
    QSPI_ERR_CMD     = 1,
    QSPI_ERR_READ    = 2,
    QSPI_ERR_WRITE   = 3,

    QSPI_ERR,
};

/* SPI Flash address mode */
enum
{
    ADDR_3BYTES = 0,
    ADDR_4BYTES,
};

/* QSPI Flash using SPI mode */
enum
{
    SerialSPI     = 0,
    SerialDUALSPI,
    SerialQUADSPI,
};

/*  W25Qxx return status
*/
enum
{
    W25Q_OK        = 0,
    W25Q_ERR_SERIAL    = 1,
    W25Q_ERR_VALUE     = 2,
    W25Q_ERR_READ      = 3,
    W25Q_ERR_WRITE     = 4,
    W25Q_ERR_TIMEOUT   = 5,
    W25Q_ERR_DEVICE    = 6,

    W25Q_ERR,    
};

/*  STATIC
*/
static void QSPI_Init(void);
static uint8_t QSPI_SendCommand(uint32_t Inst, uint32_t Addr, 
                                uint32_t dCycles, uint32_t InstMode, 
                                uint32_t AddrMode, uint32_t AddrSize, 
                                uint32_t DataMode);
static uint8_t QSPI_Transmit(uint8_t *pBuff, uint32_t wSize);   
static uint8_t QSPI_Receive(uint8_t *pBuff, uint32_t rSize);
static void W25Qxx_Reset(void);
static void W25Qxx_WriteEnable(void);
static void W25Qxx_WriteDisable(void);
static bool W25Qxx_IsWriteEnable(void);
static void W25Qxx_SetAddressMode(uint8_t mode);
static void W25Qxx_SetReadParameter(uint8_t dummy, uint8_t wrap);
static uint16_t W25Qxx_GetDeviceID(void);
static uint8_t W25Qxx_ReadSR(W25Qxxx_SR SRx, uint8_t *rVal);
static uint8_t W25Qxx_WriteSR(W25Qxxx_SR SRx, uint8_t wVal);
static void W25Qxx_QSPIEnable(void);
static void W25Qxx_QSPIDisable(void);
static bool W25Qxx_WaitBusy(uint32_t timeout);
static uint8_t W25Qxx_EraseSector(uint32_t sector);
static uint8_t W25Qxx_PageProgram(uint8_t *pBuff, uint32_t Address, uint16_t wSize);
static uint8_t W25Qxx_Read(uint8_t *pBuff, uint32_t Address, uint16_t rSize);
//static uint8_t W25Qxx_WriteSector(uint8_t *pBuff, uint32_t Addr, uint16_t wSize, uint8_t check);

static uint8_t OPRBUFFER[QSPIFLASH_SECTORSIZE];
static uint8_t QFlashSPIMode = SerialSPI;
static QSPI_HandleTypeDef QSPI_Handler;

/******************* PUBLIC FUNCTION ***************************/

/* w25qxxx init */
uint8_t QSPI_Flash_Init(void)
{
	uint8_t ret = 0;
	uint8_t TempSR = 0;

	QFlashSPIMode = SerialSPI;
    /* QSPI initialize */
    QSPI_Init();
    DelayUs(50);
    //W25Qxx_Reset();
    //W25Qxx_WaitBusy(0xfff);
    /* enable QSPI mode */
    W25Qxx_QSPIEnable();
    DelayUs(2000);
    /* get flash id */
    //printf("Get flash ID, DeviceID = 0x%04x\r\n", W25Qxx_GetDeviceID());
    if(W25Qxx_GetDeviceID() != 0xEF18)
    {
        printf("Flash ID is not W25Q256!\r\n");
        return (1);
    }

    /* set 4byte address mode */
    W25Qxx_SetAddressMode(ADDR_4BYTES);
    /* set read parameter */
    W25Qxx_SetReadParameter(3, 0);

    return (0);
}

uint8_t QSPI_Flash_EraseSectors(uint32_t StartSector, uint32_t SectorNbr)
{
    uint8_t ret;
    uint32_t currSector = StartSector;

    while(SectorNbr)
    {
        ret = W25Qxx_EraseSector(currSector);
        if(ret != W25Q_OK)
        {
            return (QSPIFLASH_ERROR_ERASE);
        }
            
        currSector++;
        SectorNbr--;
    }

    return (QSPIFLASH_ERROR_NONE);
}

/* SPI flash read */
uint8_t QSPI_Flash_Read(uint8_t *pBuff, uint32_t Address, uint16_t rSize)
{
    uint8_t ret = 0;

    ret = W25Qxx_Read(pBuff, Address, rSize);
    if(ret != W25Q_OK)
    {
        return (QSPIFLASH_ERROR_READ);
    }
    
    return (QSPIFLASH_ERROR_NONE);
}

/* bytes : number bytes one cycle */
uint8_t QSPI_Flash_ReadWithCycle(cycle cycleFunc, uint32_t Address, uint16_t rSize)
{
    uint32_t addr_reg = READ_REG(QSPI_Handler.Instance->AR);
    __IO uint32_t *data_reg = &QSPI_Handler.Instance->DR;

    uint16_t timeout = 0xffff;
    uint8_t ret = QSPI_ERR;

    if(cycleFunc == NULL) {return (W25Q_ERR_VALUE);}

	/* send read command */
	if(QFlashSPIMode == SerialQUADSPI)
	{
        ret = QSPI_SendCommand(W25Q_FAST_READ, Address, 
                             	8, QSPI_INSTRUCTION_4_LINES, 
                             	QSPI_ADDRESS_4_LINES, QSPI_ADDRESS_32_BITS, 
                               	QSPI_DATA_4_LINES);
    }
    /* send command error */ 
 	if(ret != QSPI_OK)
 	{
 	    printf("w25qxx read error_1!\r\n");
		return (W25Q_ERR_SERIAL);
    }

    QSPI_Handler.Instance->DLR = rSize - 1;
    /* Configure QSPI: CCR register with functional as indirect read */
    MODIFY_REG(QSPI_Handler.Instance->CCR, QUADSPI_CCR_FMODE, QUADSPI_CCR_FMODE_0);
    /* Start the transfer by re-writing the address in AR register */
    WRITE_REG(QSPI_Handler.Instance->AR, addr_reg);

    while(rSize)
    {
        if(__HAL_QSPI_GET_FLAG(&QSPI_Handler, QSPI_FLAG_FT|QSPI_FLAG_TC) != RESET)
        {
            cycleFunc(*(__IO uint8_t *)data_reg);

            timeout = 0xffff;
            rSize--;
        }
        /* chekc if timeout? */
        DelayUs(2);
        if(--timeout == 0) 
        {
            return (W25Q_ERR_TIMEOUT);
        }
    }

    timeout = 0xffff;
    while(timeout--)
    {
        if(__HAL_QSPI_GET_FLAG(&QSPI_Handler, QSPI_FLAG_TC) != RESET)
        {
            __HAL_QSPI_CLEAR_FLAG(&QSPI_Handler, QSPI_FLAG_TC);
        }
        DelayUs(5);
    }

    return (W25Q_OK);
}

/*  SPI Flash write, not check 
*   page auto shift
*/
uint8_t QSPI_Flash_WriteNoChk(uint8_t *pBuff, uint32_t Address, uint32_t wSize)
{
    uint8_t ret;
    uint16_t curWriteSize, remainPageSize;

    //0 ~ SPIFLASH_MEMSIZE-1
    if((Address + wSize) > QSPIFLASH_MEMSIZE)
    {
        return (QSPIFLASH_ERROR_PARAM);
    }
    /* init value 
    */
    // remian bytes in current page
    remainPageSize = QSPIFLASH_PAGESIZE - Address % QSPIFLASH_PAGESIZE;
    // current write size
    curWriteSize = (wSize <= remainPageSize) ? (wSize) : (remainPageSize);

