nusschAngE/stm32h7xx/Hardware/flash/qspi_flash.c
    while(wSize)
    {
        ret = W25Qxx_PageProgram(pBuff, Address, curWriteSize);
        if(ret != W25Q_OK)
        {
            return (QSPIFLASH_ERROR_WRITE);
        }

        pBuff += curWriteSize;
        Address += curWriteSize;
        wSize -= curWriteSize;
        if(wSize > QSPIFLASH_PAGESIZE)
            curWriteSize = QSPIFLASH_PAGESIZE;
        else
            curWriteSize = wSize;
    }

    return (QSPIFLASH_ERROR_NONE);
}

/*  SPI Flash write with check
*   page auto shift
*   sector check and erase
*/
uint8_t QSPI_Flash_WriteWithChk(uint8_t *pBuff, uint32_t Address, uint32_t wSize)
{
    uint8_t ret;
    //page program value
    uint16_t curWriteSize;
    //sector check value
    uint32_t curSector, SectorOfs, remainSectorSize;
    uint16_t i, NeedErase = 0;
    
    //0 ~ SPIFLASH_MEMSIZE-1
    if((Address + wSize) > QSPIFLASH_MEMSIZE)
    {
        return (QSPIFLASH_ERROR_PARAM);
    }

    /* init value */
    // start sector : 0 ~ SPIFLASH_SECTORNBR-1
    curSector = Address / QSPIFLASH_SECTORSIZE;
    // offset in current sector
    SectorOfs = Address % QSPIFLASH_SECTORSIZE;
    // remain bytes in current sector
    remainSectorSize = QSPIFLASH_SECTORSIZE - SectorOfs;
	// current write size
	curWriteSize = (wSize <= remainSectorSize) ? (wSize) : (remainSectorSize);

    while(wSize)
    {
    	//printf("size = %d, ofs = %d\r\n", curWriteSize, SectorOfs);
        // read current sector
        ret = W25Qxx_Read(OPRBUFFER, curSector * QSPIFLASH_SECTORSIZE, QSPIFLASH_SECTORSIZE);
        if(ret != W25Q_OK)
        {
            return (QSPIFLASH_ERROR_READ);
        }

        // check
        for(i = 0; i < curWriteSize; i++)
        {
        	//printf("%d,", OPRBUFFER[i + SectorOfs]);
            if(OPRBUFFER[i + SectorOfs] != 0xFF)
            {
            	NeedErase = 1;
                break;
            }
        }

        // need erase
        if(NeedErase)
        {
        	printf("sector[%d] need erase\r\n", curSector);
            ret = W25Qxx_EraseSector(curSector);
            if(ret != W25Q_OK)
                return (QSPIFLASH_ERROR_ERASE);

            for(i = 0; i < curWriteSize; i++)
            {
                OPRBUFFER[i + SectorOfs] = pBuff[i];
            }

            ret = QSPI_Flash_WriteNoChk(OPRBUFFER, curSector * QSPIFLASH_SECTORSIZE, QSPIFLASH_SECTORSIZE);
            if(ret != QSPIFLASH_ERROR_NONE)
                return (QSPIFLASH_ERROR_WRITE);
        }
        else
        {
            ret = QSPI_Flash_WriteNoChk(pBuff, Address, curWriteSize);
            if(ret != QSPIFLASH_ERROR_NONE)
            {
                return (QSPIFLASH_ERROR_WRITE);
            }
        }

        curSector += 1;
        SectorOfs = 0;//init state process done, set byte off to 0
        NeedErase = 0;

        pBuff += curWriteSize;
        Address += curWriteSize;
        wSize -= curWriteSize;
        /* new write size */
        if(wSize > QSPIFLASH_SECTORSIZE)
            curWriteSize = QSPIFLASH_SECTORSIZE;
        else
            curWriteSize = wSize;
    }

    return (QSPIFLASH_ERROR_NONE);
}

/******************** PUBLIC FUNCTION ********************/
/*
*   QSPI initialize
**/
static void QSPI_LLInit(void)
{
    GPIO_InitTypeDef GPIO_Init;
    /* Clock Enable */
    __HAL_RCC_QSPI_CLK_ENABLE();       
    __HAL_RCC_GPIOB_CLK_ENABLE();      
    __HAL_RCC_GPIOF_CLK_ENABLE();      
    
    GPIO_Init.Pin = GPIO_PIN_6;
    GPIO_Init.Mode = GPIO_MODE_AF_PP;        
    GPIO_Init.Pull = GPIO_PULLUP;              
    GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;  
    GPIO_Init.Alternate = GPIO_AF10_QUADSPI;   
    HAL_GPIO_Init(GPIOB, &GPIO_Init);
    
    GPIO_Init.Pin = GPIO_PIN_8 | GPIO_PIN_9;
    GPIO_Init.Mode = GPIO_MODE_AF_PP;
    GPIO_Init.Pull = GPIO_NOPULL;              
    GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;   
    GPIO_Init.Alternate = GPIO_AF10_QUADSPI;
    HAL_GPIO_Init(GPIOF, &GPIO_Init);
    
    GPIO_Init.Pin = GPIO_PIN_2;
    GPIO_Init.Mode = GPIO_MODE_AF_PP;
    GPIO_Init.Pull = GPIO_NOPULL; 
    GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_Init.Alternate = GPIO_AF9_QUADSPI;   
    HAL_GPIO_Init(GPIOB, &GPIO_Init);
    
    GPIO_Init.Pin = GPIO_PIN_6 | GPIO_PIN_7;
    GPIO_Init.Mode = GPIO_MODE_AF_PP;
    GPIO_Init.Pull = GPIO_NOPULL; 
    GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_Init.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOF, &GPIO_Init);
}

static void QSPI_Init(void)
{
    /* Clock Enable and IO Init */
    QSPI_LLInit();
    
    /* QSPI Init */
    QSPI_Handler.Instance = QUADSPI;
    QSPI_Handler.Init.ClockPrescaler = 1; //QSPI clock frequency -> 200/(CP + 1) = 100mhz
    QSPI_Handler.Init.FifoThreshold = 8;
    QSPI_Handler.Init.SampleShifting = QSPI_SAMPLE_SHIFTING_HALFCYCLE;//must set 0 in DDR mode
    QSPI_Handler.Init.FlashSize = (QSPIFLASH_MEMSIZE - 1);//32Mbyte
    QSPI_Handler.Init.ChipSelectHighTime = QSPI_CS_HIGH_TIME_5_CYCLE;//55ns
    QSPI_Handler.Init.ClockMode = QSPI_CLOCK_MODE_0;
    QSPI_Handler.Init.FlashID = QSPI_FLASH_ID_1;
    QSPI_Handler.Init.DualFlash = QSPI_DUALFLASH_DISABLE;
    HAL_QSPI_Init(&QSPI_Handler);
}

/*
*   QSPI send Command
*/
static uint8_t QSPI_SendCommand(uint32_t Inst, uint32_t Addr, 
                                uint32_t dCycles, uint32_t InstMode, 
                                uint32_t AddrMode, uint32_t AddrSize, 
                                uint32_t DataMode)
{
    QSPI_CommandTypeDef Cmdhandler;
    
    Cmdhandler.Instruction = Inst;                 	
    Cmdhandler.Address = Addr;                            
    Cmdhandler.DummyCycles = dCycles;                   
    Cmdhandler.InstructionMode = InstMode;				
    Cmdhandler.AddressMode = AddrMode;   					
    Cmdhandler.AddressSize = AddrSize;   				
    Cmdhandler.DataMode = DataMode;             				
    Cmdhandler.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;       	
    Cmdhandler.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE; 
    Cmdhandler.DdrMode = QSPI_DDR_MODE_DISABLE;           	
    Cmdhandler.DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY;
    if(HAL_QSPI_Command(&QSPI_Handler, &Cmdhandler, 0xffff) == HAL_OK)
    {
        return (QSPI_OK);
    }

    return (QSPI_ERR);
}

static uint8_t QSPI_Transmit(uint8_t *pBuff, uint32_t wSize)
{
    QSPI_Handler.Instance->DLR = wSize - 1;
    if(HAL_QSPI_Transmit(&QSPI_Handler, pBuff, 5000) == HAL_OK)
    {
        return (QSPI_OK);
    }
    return (QSPI_ERR);
}

