nusschAngE/stm32h7xx/Hardware/flash/qspi_flash.c
static uint8_t QSPI_Receive(uint8_t *pBuff, uint32_t rSize)
{
    QSPI_Handler.Instance->DLR = rSize - 1;
    if(HAL_QSPI_Receive(&QSPI_Handler, pBuff, 5000) == HAL_OK)
    {
        return (QSPI_OK);
    }
    return (QSPI_ERR);
}

/********************** W25Qxxx control ********************************/
static void W25Qxx_Reset(void)
{
	uint8_t ret = 0;

	if(QFlashSPIMode == SerialSPI)
	{
		/* send reset enable cmd */
		QSPI_SendCommand(W25Q_RESET_ENABLE, 0, 
	                   		0, QSPI_INSTRUCTION_1_LINE, 
	                    	QSPI_ADDRESS_NONE, QSPI_ADDRESS_8_BITS, 
	                    	QSPI_DATA_NONE);
		/* delay */
	    TimDelayMs(1);
	    /* send reset enable */
	    QSPI_SendCommand(W25Q_RESET, 0, 
	                   		0, QSPI_INSTRUCTION_1_LINE, 
	                    	QSPI_ADDRESS_NONE, QSPI_ADDRESS_8_BITS, 
	                    	QSPI_DATA_NONE);

  	}
  	else if(QFlashSPIMode == SerialQUADSPI)
  	{
		/* send reset enable cmd */
		QSPI_SendCommand(W25Q_RESET_ENABLE, 0, 
	                   		0, QSPI_INSTRUCTION_4_LINES, 
	                    	QSPI_ADDRESS_NONE, QSPI_ADDRESS_8_BITS, 
	                    	QSPI_DATA_NONE);
		/* delay */
	    TimDelayMs(1);
	    /* send reset enable */
	    QSPI_SendCommand(W25Q_RESET, 0, 
	                   		0, QSPI_INSTRUCTION_4_LINES, 
	                    	QSPI_ADDRESS_NONE, QSPI_ADDRESS_8_BITS, 
	                    	QSPI_DATA_NONE);

  	}
  	else
  	{
  		
  	}
}

static void W25Qxx_WriteEnable(void)
{
	uint8_t ret = QSPI_ERR;

	/* QSPI send command */
	if(QFlashSPIMode == SerialSPI)
	{
		ret = QSPI_SendCommand(W25Q_WRITE_ENABLE, 0, 
                            	0, QSPI_INSTRUCTION_1_LINE, 
                             	QSPI_ADDRESS_NONE, QSPI_ADDRESS_8_BITS, 
                              	QSPI_DATA_NONE);
	}
	else if(QFlashSPIMode == SerialQUADSPI)
	{
    	ret = QSPI_SendCommand(W25Q_WRITE_ENABLE, 0, 
                           		0, QSPI_INSTRUCTION_4_LINES, 
                             	QSPI_ADDRESS_NONE, QSPI_ADDRESS_8_BITS, 
                             	QSPI_DATA_NONE);
	}
	else
	{
      	// not support
      	ret = QSPI_ERR;
	}  

	if(ret != QSPI_OK)
	{
	    printf("w25qxx enable write error!\r\n");
	}

#if 0//debug
    TimDelayMs(1);
    if(W25Qxx_IsWriteEnable() == FALSE)
    {
        printf("w25qxx write disable!\r\n");
    }
#endif	
}

static void W25Qxx_SRWriteEnable(void)
{
	uint8_t ret = QSPI_ERR;

	/* QSPI send command */
	if(QFlashSPIMode == SerialSPI)
	{
		ret = QSPI_SendCommand(W25Q_WRITE_ENVSR, 0, 
                            	0, QSPI_INSTRUCTION_1_LINE, 
                             	QSPI_ADDRESS_NONE, QSPI_ADDRESS_8_BITS, 
                              	QSPI_DATA_NONE);
	}
	else if(QFlashSPIMode == SerialQUADSPI)
	{
    	ret = QSPI_SendCommand(W25Q_WRITE_ENVSR, 0, 
                           		0, QSPI_INSTRUCTION_4_LINES, 
                             	QSPI_ADDRESS_NONE, QSPI_ADDRESS_8_BITS, 
                             	QSPI_DATA_NONE);
	}
	else
	{
      	// not support
      	ret = QSPI_ERR;
	}  

	if(ret != QSPI_OK)
	{
	    printf("w25qxx enable status reg write error!\r\n");
	}	
}

static void W25Qxx_WriteDisable(void)
{
    uint8_t ret = QSPI_ERR;
    
    /* QSPI send command */
    if(QFlashSPIMode == SerialSPI)
    {
        ret = QSPI_SendCommand(W25Q_WRITE_DISABLE, 0, 
                                0, QSPI_INSTRUCTION_1_LINE, 
                                QSPI_ADDRESS_1_LINE, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_1_LINE);
    }
    else if(QFlashSPIMode == SerialQUADSPI)
    {
        ret = QSPI_SendCommand(W25Q_WRITE_DISABLE, 0, 
                                0, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_4_LINES, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_4_LINES);
    }
    else
    {
        // not support
    }

	if(ret != QSPI_OK)
	{
	    printf("w25qxx disable write error!r\\n");
	}
}

static bool W25Qxx_IsWriteEnable(void)
{
	uint8_t TempSR = 0, ret;

	ret = W25Qxx_ReadSR(W25Qxx_SR1, &TempSR);
	if(ret != W25Q_OK)
	{
	    return (FALSE);
	}
	
	if(TempSR & 0x02) 
	{
		return (TRUE);
    }
	else
	{
		return (FALSE);

	}	
}

static void W25Qxx_SetAddressMode(uint8_t mode)
{
    uint8_t temp = 0, ret = 0;
    uint8_t count = 10;

    if(mode == ADDR_4BYTES)
        temp = W25Q_ADDR_4BYTE;
    else
        temp = W25Q_ADDR_3BYTE;

    /* QSPI send command */
    if(QFlashSPIMode == SerialSPI)
    {
        ret = QSPI_SendCommand(temp, 0, 
                                0, QSPI_INSTRUCTION_1_LINE, 
                                QSPI_ADDRESS_NONE, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_NONE);
    }
    else if(QFlashSPIMode == SerialQUADSPI)
    {
        ret = QSPI_SendCommand(temp, 0, 
                                0, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_NONE, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_NONE);
    }
    else
    {
        /* SPI mode not support */
        ret = QSPI_ERR;
    }    

    /* send command error */ 
    if(ret != QSPI_OK)
    {
        printf("w25qxx set address mode error!\r\n");
    }
}

/*
*   QSPI Only
*   dummy[bit5:4] 
*           0 -> 2dummy 40mhz
*           1 -> 4dummy 80mhz
*           2 -> 6dummy 104mhz
*           3 -> 8dummy 104mhz
*   wrap[bit1:0] 
*           0 -> 8byte
*           1 -> 16byte
*           2 -> 32byte
*           3 -> 64byte
*/
static void W25Qxx_SetReadParameter(uint8_t dummy, uint8_t wrap)
{
    uint8_t temp = 0, ret = 0;
    
    /* QSPI send command */
    if(QFlashSPIMode == SerialQUADSPI)
    {
        ret = QSPI_SendCommand(W25Q_READ_PARA, 0, 
                                0, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_NONE, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_4_LINES);
    }
    else
    {
        /* SPI mode not support */
        ret = QSPI_ERR;
    }    

    /* send command error */ 
    if(ret != QSPI_OK)
    {
        printf("w25qxx Set Read Parameter error_1!\r\n");
        while(1)
        {}
    }

    temp = wrap | dummy << 4;
    ret = QSPI_Transmit(&temp, 1);
    if(ret != QSPI_OK)
    {
        printf("w25qxx Set Read Parameter error_2!\r\n");
        while(1)
        {}    
    }
}

