nusschAngE/stm32h7xx/Hardware/flash/qspi_flash.c
static uint16_t W25Qxx_GetDeviceID(void)
{
    uint8_t Recv[2];
    uint8_t ret = 0;

    /* QSPI send command */
#if 1	
    if(QFlashSPIMode == SerialSPI)
    {
        ret = QSPI_SendCommand(W25Q_READID, 0, 
                                0, QSPI_INSTRUCTION_1_LINE, 
                                QSPI_ADDRESS_1_LINE, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_1_LINE);
    }
    else if(QFlashSPIMode == SerialQUADSPI)
    {
        ret = QSPI_SendCommand(W25Q_READID, 0, 
                                4, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_4_LINES, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_4_LINES);
    }	
    else
    {
        /* SPI mode not support */
        ret = QSPI_ERR;
    }
#else
	ret = qspi_SendCommand(W25Q_READID, 0, 
                       		0, QSPI_INSTRUCTION_1_LINE, 
                        	QSPI_ADDRESS_1_LINE, QSPI_ADDRESS_24_BITS, 
                        	QSPI_DATA_1_LINE);
#endif

    /* send command error */ 
    if(ret != QSPI_OK)
    {
        printf("w25qxx, get device ID error_1\r\n");
        return 0;
    }

    ret = QSPI_Receive(Recv, 2);
    if(ret != QSPI_OK)
    {
        printf("w25qxx, get device ID error_2\r\n");
        return 0;
    }

    return (uint16_t)((uint16_t)(Recv[0] << 8) | Recv[1]);
}

static uint8_t W25Qxx_ReadSR(W25Qxxx_SR SRx, uint8_t *rVal)
{
    uint8_t Cmd = 0, Recv = 0;
    uint8_t ret = 0;

    /* select command ready to sent */
    switch (SRx)
    {
        case W25Qxx_SR1:
            Cmd = W25Q_READ_SR1;
            break;
        case W25Qxx_SR2:
            Cmd = W25Q_READ_SR2;
            break;
        case W25Qxx_SR3:
            Cmd = W25Q_READ_SR3;
            break; 
        default:
            Cmd = 0;
            return (W25Q_ERR_VALUE);
    }

    /* QSPI send command */
    if(QFlashSPIMode == SerialSPI)
    {
        ret = QSPI_SendCommand(Cmd, 0, 
                                0, QSPI_INSTRUCTION_1_LINE, 
                                QSPI_ADDRESS_NONE, QSPI_ADDRESS_8_BITS, 
                                QSPI_DATA_1_LINE);
    }
    else if(QFlashSPIMode == SerialQUADSPI)
    {
        ret = QSPI_SendCommand(Cmd, 0, 
                                0, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_NONE, QSPI_ADDRESS_8_BITS, 
                                QSPI_DATA_4_LINES);
    }
    else
    {
        /* SPI mode not support */
        *rVal = 0;
        ret = QSPI_ERR;
    }

    /* send command error */ 
    if(ret != QSPI_OK) return (W25Q_ERR_SERIAL);

    if(QSPI_Receive(&Recv, 1) == QSPI_OK)
    {
        *rVal = Recv;
        //printf("W25Qxx_ReadSR, SR = %d, Recv = 0x%02x\r\n", SRx, Recv);
        return (W25Q_OK);
    }
    else
    {
        *rVal = 0;
        return (W25Q_ERR_READ);
    }
}

static uint8_t W25Qxx_WriteSR(W25Qxxx_SR SRx, uint8_t wVal)
{
    uint8_t Cmd = 0;
    uint8_t ret = 0;

    /* select command ready to sent */
    switch (SRx)
    {
        case W25Qxx_SR1:
            Cmd = W25Q_WRITE_SR1;
            break;
        case W25Qxx_SR2:
            Cmd = W25Q_WRITE_SR2;
            break;
        case W25Qxx_SR3:
            Cmd = W25Q_WRITE_SR3;
            break; 
        default:
            Cmd = 0;
            return (W25Q_ERR_VALUE);
    }

    /* QSPI send command */
    if(QFlashSPIMode == SerialSPI)
    {
        ret = QSPI_SendCommand(Cmd, 0, 
                                0, QSPI_INSTRUCTION_1_LINE, 
                                QSPI_ADDRESS_NONE, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_1_LINE);
    }
    else if(QFlashSPIMode == SerialQUADSPI)
    {
        ret = QSPI_SendCommand(Cmd, 0, 
                                0, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_NONE, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_4_LINES);
    }
    else
    {
        /* SPI mode not support */
        ret = QSPI_ERR;
    }

    /* send command error */ 
    if(ret != QSPI_OK) return (W25Q_ERR_SERIAL);

    if(QSPI_Transmit(&wVal, 1) == QSPI_OK)
    {
        return (W25Q_OK);
    }
    else
    {
        return (W25Q_ERR_WRITE);
    }
}

static void W25Qxx_QSPIEnable(void)
{
    uint8_t TempSR = 0;
    uint8_t ret = 0;

	ret = W25Qxx_ReadSR(W25Qxx_SR2, &TempSR);
	if(ret != W25Q_OK)
	{
	    printf("QSPIEnable, read SR error!\r\n");
	    QFlashSPIMode = SerialSPI;
	    return ;
	}

    //printf("QSPIEnable, W25Qxxx_SR2 = 0x%02x\r\n", TempSR);
    if((TempSR & 0x02) == 0)
    {
        W25Qxx_WriteEnable();
        /* QSPI enable */
        TempSR |= 0x02;
        ret = W25Qxx_WriteSR(W25Qxx_SR2, TempSR);
        if(ret != W25Q_OK)
        {
            printf("QSPIEnable, write SR error!\r\n");
            QFlashSPIMode = SerialSPI;
            return ;
        }    
    }

	/* send QSPI Enable cmd */
    ret = QSPI_SendCommand(W25Q_QSPI_ENABLE, 0, 
                            0, QSPI_INSTRUCTION_1_LINE, 
                            QSPI_ADDRESS_NONE, QSPI_ADDRESS_24_BITS, 
                            QSPI_DATA_NONE);

    if(ret != QSPI_OK)
    {
        printf("QSPIEnable, send cmd error!\r\n");
        QFlashSPIMode = SerialSPI;
    }
    else
    {
        QFlashSPIMode = SerialQUADSPI;
    }
}

static void W25Qxx_QSPIDisable(void)
{
    uint8_t ret = 0;

    if(QFlashSPIMode == SerialQUADSPI)
    {
        ret = QSPI_SendCommand(W25Q_QSPI_DISABLE, 0, 
                                0, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_NONE, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_NONE);
    }

    if(ret == QSPI_OK)
    {
        QFlashSPIMode = SerialSPI;
    }
    else
    {
        printf("w25qxx disable QSPI error!\r\n");
    }
}

/* delay 5ms after one tune 
*   @para
*       timeout : >0
*   @return 
*       TRUE : not busy now
*       FALSE: timeout or error
*/
static bool W25Qxx_WaitBusy(uint32_t timeout)
{
    uint8_t TempSR = 0, ret;
    
    /* QSPI send command */
    if(QFlashSPIMode == SerialSPI)
    {
        ret = QSPI_SendCommand(W25Q_READ_SR1, 0, 
                                0, QSPI_INSTRUCTION_1_LINE, 
                                QSPI_ADDRESS_NONE, QSPI_ADDRESS_8_BITS, 
                                QSPI_DATA_1_LINE);
    }
    else if(QFlashSPIMode == SerialQUADSPI)
    {
        ret = QSPI_SendCommand(W25Q_READ_SR1, 0, 
                                0, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_NONE, QSPI_ADDRESS_8_BITS, 
                                QSPI_DATA_4_LINES);
    }
    else
    {
        ret = QSPI_ERR;
    }    

    if(ret != QSPI_OK)   return (FALSE);

    while(timeout--)
    {
        /* busy flag in SR1:bit0 */
     	ret = QSPI_Receive(&TempSR, 1);
     	if((ret == QSPI_OK) && ((TempSR & 0x01) == 0))
     	{
     	    return TRUE;
     	}

