nusschAngE/stm32h7xx/Hardware/flash/qspi_flash.c
     	TimDelayMs(2);
    }

    return (FALSE);
}

/* erase time > 150ms */
static uint8_t W25Qxx_EraseSector(uint32_t sector)
{
    uint32_t addr = sector * QSPIFLASH_SECTORSIZE;
    uint8_t ret = 0;

    W25Qxx_WriteEnable();
    TimDelayMs(5);
    if(W25Qxx_IsWriteEnable() == FALSE)
    {
    	printf("W25Qxx Erase Sector[%d], write disable\r\n", sector);
    	return (W25Q_ERR_DEVICE);
    }
        
    /* send erase command */
    if(QFlashSPIMode == SerialSPI)
    {
        ret = QSPI_SendCommand(W25Q_SECTOR_ERASE, addr, 
                                0, QSPI_INSTRUCTION_1_LINE, 
                                QSPI_ADDRESS_1_LINE, QSPI_ADDRESS_32_BITS, 
                                QSPI_DATA_NONE);
    }
    else if(QFlashSPIMode == SerialQUADSPI)
    {
        ret = QSPI_SendCommand(W25Q_SECTOR_ERASE, addr, 
                                0, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_4_LINES, QSPI_ADDRESS_32_BITS, 
                                QSPI_DATA_NONE);
    }
    else
    {
        ret = QSPI_ERR;
    }

    if(ret == QSPI_OK)
    {
        //waite > 150ms
        if(W25Qxx_WaitBusy(40) == FALSE)
        {
            printf("w25qxx erase sector[%d] timeout!\r\n", sector);
            return (W25Q_ERR_TIMEOUT);
        }
    }
    else
    {
        printf("w25qxx erase sector[%d] error!\r\n", sector);
        return (W25Q_ERR_SERIAL);
    }

    return (W25Q_OK);
}

/*
*   Page Program, wSize <= 256. Just program in one page(0~65535).
*   QSPI Only
*/
static uint8_t W25Qxx_PageProgram(uint8_t *pBuff, uint32_t Address, uint16_t wSize)
{
    uint8_t ret = 0;

    W25Qxx_WriteEnable();
    TimDelayMs(5);
    if(W25Qxx_IsWriteEnable() == FALSE)
    {
    	printf("W25Qxx_PageProgram, write diable, address = 0x%08x\r\n", Address);
    	return (W25Q_ERR_DEVICE);
    }
        
    /* send page program command */
    if(QFlashSPIMode == SerialQUADSPI)
    {
        ret = QSPI_SendCommand(W25Q_PAGE_PROGRAM, Address, 
                                0, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_4_LINES, QSPI_ADDRESS_32_BITS, 
                                QSPI_DATA_4_LINES);
    }
    else
    {
        ret = QSPI_ERR;
    }
    
	/* send page program command error */
	if(ret != QSPI_OK)
	{
	    printf("w25qxx page program error_1, addr = 0x%08x\r\n", Address);
		return (W25Q_ERR_SERIAL);
    }
    
	/* QSPI send data */
	ret = QSPI_Transmit(pBuff, wSize);
	if(ret == QSPI_OK)
	{
		if(W25Qxx_WaitBusy(0xfff) == FALSE)
		{
			printf("w25qxx page program error_2, addr = 0x%08x\r\n", Address);
			return (W25Q_ERR_TIMEOUT);
		}
	}
	else
	{
	    printf("w25qxx page program error_3, addr = 0x%08x\r\n", Address);
		return (W25Q_ERR_WRITE);
	}

	return W25Q_OK;
}

/* QSPI Only */
static uint8_t W25Qxx_Read(uint8_t *pBuff, uint32_t Address, uint16_t rSize)
{
    uint8_t ret = 0;

	/* send read command */
	if(QFlashSPIMode == SerialQUADSPI)
	{
        ret = QSPI_SendCommand(W25Q_FAST_READ, Address, 
                             	8, QSPI_INSTRUCTION_4_LINES, 
                             	QSPI_ADDRESS_4_LINES, QSPI_ADDRESS_32_BITS, 
                               	QSPI_DATA_4_LINES);
    }
    else
    {
        ret = QSPI_ERR;
    }
    
	/* send command error */ 
 	if(ret != QSPI_OK)
 	{
 	    printf("w25qxx read error_1!\r\n");
		return (W25Q_ERR_SERIAL);
    }
    
	/* QSPI receive data */
	ret = QSPI_Receive(pBuff, rSize);
	if(ret != QSPI_OK)
 	{
 	    printf("w25qxx read error_2!\r\n");
		return (W25Q_ERR_READ);
    }

    return (W25Q_OK);
}



